{
	"terrain": {
		"grassland": {
			"name": "Grassland",
			"description": "Fertile plains perfect for farming and settlement."
		},
		"forest": {
			"name": "Forest",
			"description": "Dense woodlands providing lumber and shelter."
		},
		"mountain": {
			"name": "Mountain",
			"description": "Towering peaks rich in minerals but difficult to traverse."
		},
		"ocean": {
			"name": "Ocean",
			"description": "Deep waters impassable by land units."
		},
		"coast": {
			"name": "Coast",
			"description": "Shallow waters along the shoreline, rich in fish."
		},
		"river": {
			"name": "River",
			"description": "Flowing freshwater providing irrigation and fish."
		},
		"lake": {
			"name": "Lake",
			"description": "Still freshwater bodies supporting diverse wildlife."
		},
		"plains": {
			"name": "Plains",
			"description": "Open flatlands suitable for settlement and grazing."
		},
		"beach": {
			"name": "Beach",
			"description": "Sandy shores between land and sea."
		},
		"floodplains": {
			"name": "Floodplains",
			"description": "Fertile lowlands enriched by seasonal flooding, ideal for agriculture."
		},
		"meadow": {
			"name": "Meadow",
			"description": "Open grasslands with wildflowers, good for grazing."
		},
		"rolling_hills": {
			"name": "Rolling Hills",
			"description": "Gentle slopes suitable for herding and light farming."
		},
		"sharp_hills": {
			"name": "Sharp Hills",
			"description": "Rugged terrain with steep slopes, good for grazing hardy livestock."
		},
		"steppe": {
			"name": "Steppe",
			"description": "Vast semi-arid grasslands ideal for pastoral herding."
		},
		"savannah": {
			"name": "Savannah",
			"description": "Tropical grasslands with scattered trees, supporting diverse wildlife."
		},
		"marsh": {
			"name": "Marsh",
			"description": "Waterlogged wetlands rich in reeds and aquatic plants, challenging to traverse but valuable for fiber harvesting."
		}
	},
	"resource": {
		"food": {
			"name": "Food",
			"description": "Sustains your population and allows growth."
		},
		"wood": {
			"name": "Wood",
			"description": "Essential material for construction."
		},
		"stone": {
			"name": "Stone",
			"description": "Durable building material for advanced structures."
		},
		"tools": {
			"name": "Tools",
			"description": "Crafted implements that improve work efficiency and enable new activities."
		},
		"fiber": {
			"name": "Fiber",
			"description": "Raw plant material gathered from reeds and grasses, used for weaving cloth and cordage."
		},
		"clothing": {
			"name": "Clothing",
			"description": "Woven garments that protect against the elements and improve quality of life."
		},
		"clay": {
			"name": "Clay",
			"description": "Malleable earth extracted from deposits, shaped and fired to create pottery and building materials."
		},
		"pottery": {
			"name": "Pottery",
			"description": "Fired clay vessels for storage, cooking, and trade. Essential for food preservation and daily life."
		},
		"bricks": {
			"name": "Bricks",
			"description": "Sun-dried and kiln-fired clay blocks mixed with fiber for strength. A durable building material for permanent structures."
		},
		"honey": {
			"name": "Honey",
			"description": "Sweet golden nectar harvested from managed bee colonies. A precious luxury used for food, medicine, and trade."
		},
		"furs": {
			"name": "Furs",
			"description": "Animal pelts obtained from hunting, scraped and dried for use in warm clothing and trade goods."
		},
		"population": {
			"name": "Population",
			"description": "The workforce that powers your civilization."
		},
		"admin_capacity": {
			"name": "Administrative Capacity",
			"description": "Determines how many buildings your city can manage efficiently."
		},
		"research": {
			"name": "Research",
			"description": "Advances your knowledge and unlocks new technologies."
		},
		"grain": {
			"name": "Grain",
			"description": "Harvested cereal crops used for food and brewing. Stores well in dry conditions."
		},
		"grapes": {
			"name": "Grapes",
			"description": "Ripe fruit from cultivated vines, prized for winemaking. Must be processed quickly before spoiling."
		},
		"beer": {
			"name": "Beer",
			"description": "Fermented grain beverage that keeps indefinitely. A valuable luxury and trade good."
		},
		"wine": {
			"name": "Wine",
			"description": "Fermented grape drink that improves with age. A prestigious luxury sought by elites and traders alike."
		}
	},
	"modifier": {
		"copper_deposit": {
			"name": "Copper Deposit",
			"description": "A rich vein of copper ore ready for mining."
		},
		"fertile_soil": {
			"name": "Fertile Soil",
			"description": "Exceptionally rich earth that increases agricultural yields."
		},
		"clay_deposit": {
			"name": "Clay Deposit",
			"description": "A site rich in workable clay, ideal for pottery production."
		},
		"dense_forest": {
			"name": "Dense Forest",
			"description": "Thick woodland providing abundant timber and game, but slowing movement."
		},
		"sparse_forest": {
			"name": "Sparse Forest",
			"description": "Scattered trees providing moderate wood and hunting opportunities."
		},
		"dense_jungle": {
			"name": "Dense Jungle",
			"description": "Lush tropical vegetation teeming with life but difficult to traverse."
		},
		"sparse_jungle": {
			"name": "Sparse Jungle",
			"description": "Tropical vegetation with clearings, offering food and wood."
		},
		"game_trails": {
			"name": "Game Trails",
			"description": "Paths frequented by wild animals, excellent for hunting."
		},
		"berry_bushes": {
			"name": "Berry Bushes",
			"description": "Wild shrubs bearing edible berries for gathering."
		},
		"stone_outcrops": {
			"name": "Stone Outcrops",
			"description": "Exposed rock formations providing accessible building stone."
		},
		"stone_outcrop": {
			"name": "Stone Outcrop",
			"description": "Exposed rock providing accessible building stone."
		},
		"freshwater_spring": {
			"name": "Freshwater Spring",
			"description": "A natural source of clean water, vital for settlement."
		},
		"fresh_water": {
			"name": "Fresh Water",
			"description": "A source of clean drinking water."
		},
		"fish": {
			"name": "Fish",
			"description": "Waters teeming with fish, ideal for fishing."
		},
		"flint_deposit": {
			"name": "Flint Deposit",
			"description": "Nodules of flint suitable for tool-making."
		},
		"wild_game": {
			"name": "Wild Game",
			"description": "Area frequented by wild animals, excellent for hunting."
		},
		"path": {
			"name": "Path",
			"description": "A cleared dirt trail that speeds travel for all units, especially wheeled transport."
		}
	},
	"building": {
		"longhouse": {
			"name": "Longhouse",
			"description": "A large communal dwelling serving as the center of your settlement. Provides basic storage, housing, and administration."
		},
		"hut": {
			"name": "Hut",
			"description": "A simple thatched dwelling providing basic shelter for a small family."
		},
		"hunters_lodge": {
			"name": "Hunter's Lodge",
			"description": "A base for hunting expeditions into nearby forests. Produces food from game and contributes to animal husbandry knowledge."
		},
		"fishing_hut": {
			"name": "Fishing Hut",
			"description": "A small shelter near water for fishermen. Harvests fish from nearby coasts, rivers, and lakes."
		},
		"gathering_hut": {
			"name": "Gathering Hut",
			"description": "A shelter for foragers who collect wild plants, berries, and wood from the surrounding land."
		},
		"food_cache": {
			"name": "Food Cache",
			"description": "A protected storage pit for preserving food supplies. Reduces spoilage through cool, dry conditions."
		},
		"cleared_field": {
			"name": "Cleared Field",
			"description": "An organized area for storing wood, stone, and tools. Keeps materials dry and accessible."
		},
		"flint_knapper": {
			"name": "Flint Knapper",
			"description": "A workshop where skilled craftsmen shape stone into useful tools through precise flaking techniques."
		},
		"cultivated_plot": {
			"name": "Cultivated Plot",
			"description": "Tilled soil prepared for planting crops. More productive than foraging, especially near water sources."
		},
		"herding_grounds": {
			"name": "Herding Grounds",
			"description": "Fenced pastures for raising livestock. Best suited for hilly terrain with good grazing."
		},
		"granary": {
			"name": "Granary",
			"description": "An elevated storage structure protecting harvested grain from moisture and pests. Significantly reduces food decay."
		},
		"crop_field": {
			"name": "Crop Field",
			"description": "Well-tilled agricultural land with proper irrigation and soil management. Produces abundant harvests but requires more tools to maintain."
		},
		"pasture": {
			"name": "Pasture",
			"description": "Enclosed grazing land with managed rotation and water access. Supports larger herds on highland terrain."
		},
		"tribal_camp": {
			"name": "Tribal Camp",
			"description": "An organized settlement with multiple structures around a central gathering area. Provides greater administrative capacity for expanding communities."
		},
		"waycamp_lodge": {
			"name": "Waycamp Lodge",
			"description": "A sturdy temporary lodge serving as the center of a seasonal camp. Lighter than a longhouse but sufficient for a forward outpost."
		},
		"pit_house": {
			"name": "Pit House",
			"description": "A semi-subterranean dwelling with an earth-covered roof. Maintains stable temperatures and accommodates more residents, but requires clothing for comfort."
		},
		"reed_marsh": {
			"name": "Reed Marsh",
			"description": "A managed wetland area for harvesting reeds and cattails. The gathered plant fibers are essential for weaving and cordage."
		},
		"weaver": {
			"name": "Weaver",
			"description": "A workshop equipped with a loom for producing cloth from plant fibers. Skilled weavers transform raw fiber into durable clothing."
		},
		"storytellers_fire": {
			"name": "Storyteller's Fire",
			"description": "A communal gathering place where elders share knowledge and traditions around a sacred fire. Produces research and gains bonuses from nearby housing."
		},
		"woodcutter": {
			"name": "Woodcutter",
			"description": "A logging camp where workers harvest timber from nearby forests. Must be built on or adjacent to forest terrain."
		},
		"clay_pit": {
			"name": "Clay Pit",
			"description": "An excavated site for extracting clay from deposits in the earth. The raw clay is used for pottery and construction."
		},
		"pottery_kiln": {
			"name": "Pottery Kiln",
			"description": "A domed oven for firing clay into durable pottery. Transforms raw clay into vessels for storage and trade."
		},
		"brick_kiln": {
			"name": "Brick Kiln",
			"description": "A long rectangular kiln where clay mixed with fiber is shaped and fired into sturdy bricks. Benefits from nearby clay pits."
		},
		"elders_dwelling": {
			"name": "Elder's Dwelling",
			"description": "A respected elder's residence where wisdom is preserved and shared. Produces significant research but requires comfort, sustenance, and honey as a luxury."
		},
		"tanner": {
			"name": "Tanner",
			"description": "A workshop where animal hides are scraped, soaked, and worked into supple leather clothing. Benefits from proximity to hunting lodges."
		},
		"furwrights_hollow": {
			"name": "Furwright's Hollow",
			"description": "A place where animal hides are scraped and stitched into simple clothing."
		},
		"apiary": {
			"name": "Apiary",
			"description": "A collection of woven skep hives where bees are kept for honey production. Thrives near flowering crops and meadows."
		},
		"stone_quarry": {
			"name": "Stone Quarry",
			"description": "A site where workers extract and shape stone blocks from hillside rock faces. Best suited for elevated terrain with exposed stone."
		},
		"sacred_barrow": {
			"name": "Sacred Barrow",
			"description": "A monumental burial mound honoring the ancestors. Its lengthy construction demands sustained effort, but the completed site becomes a lasting source of spiritual knowledge."
		},
		"smoke_house": {
			"name": "Smoke House",
			"description": "A low timber structure where meat and fish are cured over smoldering wood. Nearby granaries benefit from reduced food spoilage."
		},
		"irrigation_canal": {
			"name": "Irrigation Canal",
			"description": "A stone-lined channel that diverts fresh water from a nearby river or lake onto farmland. Provides a fresh water source that boosts adjacent crop yields."
		},
		"grain_field": {
			"name": "Grain Field",
			"description": "Irrigated fields of emmer and barley fed by canal water. Produces grain for food and brewing."
		},
		"brewery": {
			"name": "Brewery",
			"description": "A fermentation workshop where grain is soaked, sprouted, and brewed into beer. Benefits from nearby grain fields."
		},
		"vineyard": {
			"name": "Vineyard",
			"description": "Terraced rows of cultivated grapevines trained on wooden trellises. Thrives on hillsides with good drainage."
		},
		"winery": {
			"name": "Winery",
			"description": "A stone-walled workshop where grapes are trodden and the juice fermented in clay amphorae. Benefits from nearby vineyards."
		},
		"city_center": {
			"name": "City Center",
			"description": "The heart of your city, providing basic resources and administration."
		},
		"farm": {
			"name": "Farm",
			"description": "Produces food to feed your population."
		},
		"house": {
			"name": "House",
			"description": "Provides housing for your growing population."
		},
		"road_dirt": {
			"name": "Dirt Road",
			"description": "Basic road allowing faster movement for caravans."
		}
	},
	"tech_branch": {
		"agriculture": {
			"name": "Agriculture",
			"description": "The science of cultivating plants and livestock."
		},
		"construction": {
			"name": "Construction",
			"description": "Techniques for building structures and infrastructure."
		},
		"mining": {
			"name": "Mining",
			"description": "Extracting valuable minerals from the earth."
		},
		"animal_husbandry": {
			"name": "Animal Husbandry",
			"description": "The breeding and care of domesticated animals."
		},
		"gathering_and_crafting": {
			"name": "Gathering & Crafting",
			"description": "Skills in collecting natural resources and crafting useful items."
		},
		"oral_tradition": {
			"name": "Oral Tradition",
			"description": "The preservation and transmission of knowledge through spoken word and storytelling."
		},
		"philosophy": {
			"name": "Philosophy",
			"description": "Abstract reasoning and contemplation about existence, knowledge, and values."
		},
		"mysticism": {
			"name": "Mysticism",
			"description": "Spiritual practices and beliefs connecting humanity to the divine and the natural world."
		},
		"medicine": {
			"name": "Medicine",
			"description": "Healing arts using herbs, treatments, and knowledge of the body."
		},
		"warfare": {
			"name": "Warfare",
			"description": "Military tactics, weapons, and defensive strategies."
		},
		"commerce": {
			"name": "Commerce",
			"description": "Trade, exchange, and economic systems."
		},
		"communication": {
			"name": "Communication",
			"description": "Methods of transmitting information across distances and preserving knowledge."
		},
		"governance": {
			"name": "Governance",
			"description": "Systems of leadership, laws, and social organization."
		},
		"diplomacy": {
			"name": "Diplomacy",
			"description": "The art of negotiation, alliances, and peaceful relations between peoples."
		},
		"engineering": {
			"name": "Engineering",
			"description": "Applied sciences for designing and building complex structures and machines."
		},
		"material_science": {
			"name": "Material Science",
			"description": "Understanding and manipulating materials like metals, ceramics, and alloys."
		},
		"transportation": {
			"name": "Transportation",
			"description": "Methods of moving people and goods across land and water."
		},
		"public_administration": {
			"name": "Public Administration",
			"description": "Managing resources, taxation, and public services for larger populations."
		},
		"natural_sciences": {
			"name": "Natural Sciences",
			"description": "Systematic observation and understanding of the natural world."
		},
		"energy": {
			"name": "Energy",
			"description": "Harnessing natural forces like fire, water, and wind for productive use."
		}
	},
	"milestone": {
		"timber_framing": {
			"name": "Timber Framing",
			"description": "Wooden structural frameworks enabling larger and more durable buildings."
		},
		"pack_animal_domestication": {
			"name": "Pack Animal Domestication",
			"description": "Taming animals to carry loads and assist in hunting."
		},
		"foraging": {
			"name": "Foraging",
			"description": "Systematic knowledge of gathering edible plants and useful materials from the wild."
		},
		"natural_shelter": {
			"name": "Natural Shelter",
			"description": "Using caves and natural formations for protection and storage."
		},
		"lithic_reduction": {
			"name": "Lithic Reduction",
			"description": "Shaping stone through controlled flaking techniques to create tools."
		},
		"digging_sticks": {
			"name": "Digging Sticks",
			"description": "Simple pointed tools for breaking soil and planting seeds."
		},
		"livestock_domestication": {
			"name": "Livestock Domestication",
			"description": "Raising animals for food, milk, and other products."
		},
		"seed_selection": {
			"name": "Seed Selection",
			"description": "Choosing and saving the best seeds for planting, improving crop yields over generations."
		},
		"soil_tillage": {
			"name": "Soil Tillage",
			"description": "Breaking and turning soil to improve aeration and nutrient availability for crops."
		},
		"pastoral_management": {
			"name": "Pastoral Management",
			"description": "Organized practices for rotating grazing land and maintaining healthy herds."
		},
		"post_and_lintel": {
			"name": "Post and Lintel",
			"description": "Architectural technique using vertical posts and horizontal beams to create sturdy structures."
		},
		"mudbrick": {
			"name": "Mudbrick",
			"description": "Creating durable building materials from clay, straw, and water, dried in the sun."
		},
		"cordage_and_weaving": {
			"name": "Cordage and Weaving",
			"description": "Techniques for twisting fibers into rope and interlacing threads to create cloth."
		},
		"fire_mastery": {
			"name": "Fire Mastery",
			"description": "Controlled use of fire for warmth, cooking, and protection against predators."
		},
		"hafted_axes": {
			"name": "Hafted Axes",
			"description": "Stone axe heads bound to wooden handles, enabling efficient woodcutting and construction."
		},
		"pottery_kiln": {
			"name": "Pottery Kiln",
			"description": "Firing clay at high temperatures to create durable, waterproof vessels."
		},
		"oral_tradition": {
			"name": "Oral Tradition",
			"description": "Systematic preservation of knowledge through memorized stories, songs, and teachings."
		},
		"apiculture": {
			"name": "Apiculture",
			"description": "The art of managing bee colonies in woven hives to harvest honey and wax. Requires understanding of both animals and flowering plants."
		},
		"burial_rites": {
			"name": "Burial Rites",
			"description": "Formalized ceremonies for honoring the dead, binding communities through shared spiritual practice and reverence for ancestors."
		},
		"agriculture_1": {
			"name": "Plant Domestication",
			"description": "Understanding which plants can be cultivated. Unlocks basic farms."
		},
		"agriculture_2": {
			"name": "Irrigation",
			"description": "Controlling water flow to increase yields. Unlocks granaries."
		},
		"construction_1": {
			"name": "Mudbrick Construction",
			"description": "Creating durable building materials from clay and straw."
		}
	},
	"unit": {
		"nomadic_band": {
			"name": "Nomadic Band",
			"description": "A wandering group of people seeking a place to call home. Can found an encampment on suitable terrain."
		},
		"nomadic_expedition": {
			"name": "Nomadic Expedition",
			"description": "An organized party of skilled builders sent to establish a seasonal camp in distant lands."
		},
		"caravan": {
			"name": "Caravan",
			"description": "Pack animals and merchants carrying trade goods between cities. Establishes trade routes."
		},
		"explorer": {
			"name": "Explorer",
			"description": "A swift scout who can traverse difficult terrain with ease. Reveals the map and discovers new lands."
		},
		"hand_cart": {
			"name": "Hand Cart",
			"description": "A simple two-wheeled cart pushed by a worker. Can carry goods between cities and build paths along the way."
		},
		"club_wielder": {
			"name": "Club Wielder",
			"description": "A fighter armed with a heavy wooden club. Basic but effective for defending settlements against early threats."
		}
	},
	"perk": {
		"agricultural_society": {
			"name": "Agricultural Society",
			"description": "Your civilization has mastered the art of farming, becoming experts in food production."
		},
		"pastoral_heritage": {
			"name": "Pastoral Heritage",
			"description": "A deep tradition of herding and livestock management, yielding greater returns from grazing lands."
		},
		"stoneworkers_tradition": {
			"name": "Stoneworkers' Tradition",
			"description": "Generations of stone masonry expertise, improving quarrying efficiency and reducing administrative burden."
		},
		"river_people": {
			"name": "River People",
			"description": "A culture shaped by fertile riverbanks, skilled at cultivating floodplain crops."
		},
		"lore_keepers": {
			"name": "Lore Keepers",
			"description": "A society that values oral tradition and knowledge sharing, accelerating the pace of discovery."
		},
		"woodland_stewards": {
			"name": "Woodland Stewards",
			"description": "Experienced foresters who harvest timber sustainably, maximizing output from wooded lands."
		},
		"clay_artisans": {
			"name": "Clay Artisans",
			"description": "Master potters and brickmakers whose expertise reduces waste and increases clay product output."
		},
		"frontier_settlers": {
			"name": "Frontier Settlers",
			"description": "A restless people accustomed to founding new settlements, building shelters quickly and governing far-flung territories."
		}
	},
	"settlement": {
		"encampment": {
			"name": "Encampment",
			"description": "A permanent settlement built around a longhouse. The foundation of your civilization."
		},
		"seasonal_camp": {
			"name": "Seasonal Camp",
			"description": "A lighter forward outpost centered on a waycamp lodge. Cheaper to maintain but with fewer resources."
		}
	}
}
